<template>
  <div id="app">
    <router-view v-if="isRouterAlive" />
  </div>
</template>
<script>
export default {
  name: "App",
  provide() {
    return {
      reload: this.reload,
      articleListItem: [
        {
          id: 1,
          imgSrc: require("./assets/article1.jpg"),
          title: "315晚会曝光SDK窃秘隐私，个人信息安全刻不容缓",
          time: "2020/07/20",
          content:
            "近几年，个人信息安全成为广大网民关注的焦点伴随着2018年欧盟GDPR的正式实施，我国的个人信息保护法相继出台。今年正式颁布的《民法典》中特别强调了“收集处理个人信息”需要“获得个人信息主体的授权同意”，并不得过度处理”。今年6月20日，全国人大常委会年度立法工作计划公布，在初次审议的29个法律案中，就包含“个人信息保护法”和“数据安全法”。随着网络安全的法律法规的完善，加上国家对民众对网络安全与信息保护意识的大力投入，所以现在关注315晚会的朋友也越来越多也越来越群众化。因新冠疫情影响，今年的315晚会推迟到了7月16日晚在央视播出，一经公布便迅速吸引了民众的眼光，可谓是“一石激起千层浪”，而其中个人信息的则成了重灾区。50多款手机APP暗藏窃贼插件" +
            "据央视报道，上海市消费者权益保护委员会委托技术人员检测了50多款手机软件，发现含有上海氪信信息技术有限公司和北京招彩旺旺信息技术有限公司两家公司的SDK插件，都存在在用户不知情的情况下，偷偷窃取用户隐私的嫌疑。该事件涉及国美易卡、空调遥控器、最强手电、91极速购、天天回收、闪到、萝卜商城、紫金普惠等50多款手机软件。迄今为止的全国APP专项治理工作及净网2019、2020的各地监管的检查工作中，我们可发现市面上90%以上的APP存在安全漏洞、个人数据非法采集、滥用、个人隐私管理混乱等违法违规现象，此次315晚会，个人信息安全上黑榜也是情理之中，而对于企业与开发者来说，我们该怎么去自查第三方SDK引入风险以及自身的业务是否会带来这些风险呢？ <br> 1.第三方SDK引入前的合规检查" +
            "通过蛮犀科技SDK合规评测服务，全面检测第三方SDK中存在的安全漏洞、隐私专项检测、场景检测和权限过度收集等检测，并将权限滥用、信息非法收集、信息泄露等严重问题，结合时下相关法律法规和监管要求，帮企业、开发者高效、低成本地做SDK引入的合规自查，满足监管要求。<br>  2.第三方SDK引入后的APP隐私专项检查通过蛮犀科技精细化的隐私合规专项检查，全面检测APP中个人信息过度收集、个人信息滥用、个人信息是否安全存储等行为进行检测，帮企业高效、低成本地做APP合规自查，满足监管要求。<br> 3.APP多维度防御方案，提升自我防御能力蛮犀科技经过长时间市场分析以及产品论证，针对性的研发了对应的移动应用加固系统，针对APP对象提供源码混淆技术、应用加壳、字节码抽取、字节码虚拟化、字节码转移、汇编指令虚拟化等代码加密技术；内置密钥白盒对缓存文件的数据加密技术；应用运行时的风险监控技术，为用户提供全面的移动应用加固和攻击防范解决方案。" +
            "关于蛮犀科技蛮犀科技通过十多年的移动互联网安全的技术积累，具备从风险检测、安全加固、数据合规、情报分析，让以APP为的信息安全形成一个生态闭环，做到 “事前能预警，事中可防护，事后能追溯”，从根本上保障企业和开发者的利益。"
        },
        {
          id: 2,
          imgSrc: require("./assets/article2.png"),
          title: "伟大历程,初心不变|热烈庆祝中国共产党建党99周年",
          time: "2020/07/01",
          content: "..."
        },
        {
          id: 3,
          imgSrc: require("./assets/article3.png"),
          title: "好酒沈醉佳节,十分酒,一分歌。",
          time: "2020/06/25",
          content: "..."
        },
        {
          id: 4,
          imgSrc: require("./assets/article4.png"),
          title: "重磅发布|APP违法违规收集使用个人信息专项治理报告(2019)",
          time: "2020/06/05",
          content:
            "2019年1月，中央网信办、工业和信息化部、公安部、市场监管总局四部门联合发布《关于开展APP违法违规收集使用个人信息专项治理的公告》，在全国范围组织开展APP违法违规收集使用个人信息专项治理，并成立APP违法违规收集使用个人信息专项治理工作组。一年来，专项治理工作成效显著，《APP违法违规收集使用个人信息行为认定方法》《个人信息安全规范》等标准规范相继出台完善，用户规模大、与生活关系密切、问题反映集中的千余款APP经深度评估后进行了有效整改，无隐私政策、强制索权、无注销渠道等问题明显改善，APP运营者履行个人信息保护责任义务的能力和水平明显提升，全社会关注和重视个人信息安全的氛围基本形成。"
        }
      ]
    };
  },
  data() {
    return {
      isRouterAlive: true //控制试图是否显示的变量
    };
  },
  methods: {
    reload() {
      this.isRouterAlive = false;
      this.$nextTick(() => {
        this.isRouterAlive = true;
      });
    }
  },
  watch: {
    $route(to, from) {
      if (to.path) {
        this.reload();
      }
    }
  }
};
</script>
<style>
* {
  margin: 0;
  padding: 0;
}

ul {
  list-style: none;
}

a {
  text-decoration: none;
  color: #333;
}
html,
body {
  height: 100%;
  min-width: 1240px;
}
#app {
  height: 100%;
}
</style>
